src/toir_cf/src/ChartsOfCharacteristicTypes/торо_ГруппыХарактеристикОборудования/торо_ГруппыХарактеристикОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>торо_ГруппыХарактеристикОборудования</name>
  <type>
    <types>EnumRef.торо_ТипЭксплуатации</types>
    <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    <types>CatalogRef.торо_МерыБезопасности</types>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
    <types>CatalogRef.торо_ТехнологическиеОперации</types>
    <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.торо_ТиповыеОР</types>
    <types>CatalogRef.Должности</types>
    <types>CatalogRef.торо_ЦепочкиРемонта</types>
    <types>CatalogRef.УпаковкиНоменклатуры</types>
    <types>EnumRef.Периодичность</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.торо_ВидыПусковОР</types>
    <types>CatalogRef.ПапкиФайлов</types>
    <types>EnumRef.СтавкиНДС</types>
    <types>CatalogRef.торо_ПричиныДефектов</types>
    <types>CatalogRef.торо_РесурсыРемонтнойБригады</types>
    <types>EnumRef.торо_ОтветственныеЛица</types>
    <types>CatalogRef.торо_ОбъектыРемонта</types>
    <types>EnumRef.торо_ВидыСравнения</types>
    <types>EnumRef.ТипыНоменклатуры</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    <types>CatalogRef.торо_ВидыЭксплуатации</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>EnumRef.ГрадацииКачества</types>
    <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ВидыЦен</types>
    <types>Boolean</types>
    <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>EnumRef.РолиСотрудников</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.РассылкиОтчетов</types>
    <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    <types>CatalogRef.СерииНоменклатуры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ПроизводственныеКалендари</types>
    <types>EnumRef.торо_УсловияРабот</types>
    <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    <types>String</types>
    <types>CatalogRef.торо_КритичностьДефекта</types>
    <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    <types>Date</types>
    <types>CatalogRef.СтраныМира</types>
    <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    <types>CatalogRef.торо_СтруктурыОР</types>
    <types>Number</types>
    <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    <types>CatalogRef.торо_РемонтныеБригады</types>
    <types>CatalogRef.Производители</types>
    <types>EnumRef.торо_СтатусыОРВУчете</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Организации</types>
    <types>EnumRef.торо_СпособыВыполненияРемонтов</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>EnumRef.ВидыКадровыхСобытий</types>
    <types>CatalogRef.торо_Комиссии</types>
    <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    <types>EnumRef.СпособыСтроительства</types>
    <types>CatalogRef.ЕдиницыИзмерения</types>
    <types>EnumRef.торо_ВидыПростояОборудования</types>
    <types>EnumRef.ТипыСкладов</types>
    <types>EnumRef.ВидыЗанятости</types>
    <types>EnumRef.ТипыДоговоров</types>
    <types>EnumRef.ДниНедели</types>
    <types>CatalogRef.торо_Сезоны</types>
    <types>CatalogRef.Календари</types>
    <types>CatalogRef.торо_ВидыРемонтов</types>
    <types>CatalogRef.СтавкиНДС</types>
    <types>CatalogRef.торо_ВидыДефектов</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <attributes>
    <name>ЗаполнятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокХарактеристик</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыАвтозаполнения</name>
    <attributes>
      <name>НаименованиеХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/toir_cf/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСведений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредопределенногоНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСведения</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредопределенногоНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/ChartsOfCharacteristicTypes/торо_ГруппыХарактеристикОборудования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОтобратьХарактеристикиОборудования(ТипЗначения, ПараметрыАвтозаполнения = Неопределено) Экспорт

	МассивОтобранный = Новый Массив;
	
	МассивРодителей = Новый Массив;
	МассивРодителей.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_ОбъектыРемонта"));
	МассивРодителей.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_НаправленияОбъектовРемонтныхРабот"));
	МассивРодителей.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_ТиповыеОР"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	              	|	ТЧРеквизитов.Свойство КАК Свойство
	              	|ПОМЕСТИТЬ СписокСвойств
	              	|ИЗ
	              	|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	              	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ТЧРеквизитов
	              	|		ПО (ТЧРеквизитов.Ссылка = НаборыДополнительныхРеквизитовИСведений.Ссылка)
	              	|ГДЕ
	              	|	НаборыДополнительныхРеквизитовИСведений.Ссылка В ИЕРАРХИИ(&Родитель)
	              	|	И НЕ НаборыДополнительныхРеквизитовИСведений.ПометкаУдаления
	              	|	И НЕ НаборыДополнительныхРеквизитовИСведений.КоличествоРеквизитов = """"
	              	|	И НЕ ТЧРеквизитов.ПометкаУдаления
	              	|	И ТЧРеквизитов.Свойство.Заголовок В(&Наименование)
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	СписокСвойств.Свойство КАК Свойство,
	              	|	СписокСвойств.Свойство.ТипЗначения КАК ТипЗначения
	              	|ИЗ
	              	|	СписокСвойств КАК СписокСвойств";
	
	Запрос.УстановитьПараметр("Родитель", МассивРодителей);
	
	Если ПараметрыАвтозаполнения = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТЧРеквизитов.Свойство.Заголовок В(&Наименование)", "");
	Иначе
		Запрос.УстановитьПараметр("Наименование", ПараметрыАвтозаполнения.ВыгрузитьКолонку("НаименованиеХарактеристики"));
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ТипЗначенияПодходит(ТипЗначения, Выборка.ТипЗначения) Тогда
			МассивОтобранный.Добавить(Выборка.Свойство);
		КонецЕсли;	
	КонецЦикла;

	Возврат МассивОтобранный;
	
КонецФункции

Процедура АктуализироватьГруппыХарактеристик(ДопРеквизитОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДопРеквизитОбъект.ЭтоДополнительноеСведение Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопРеквизитОбъект.ПометкаУдаления Тогда
		УдалитьДопРеквизитИзГруппСАвтозаполнением(ДопРеквизитОбъект.Ссылка);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоДопРеквизитОР(ДопРеквизитОбъект.НаборСвойств) Тогда
		Возврат;
	КонецЕсли;
	
	ГруппыГдеЕстьРеквизит = НайтиДопРеквизитВГруппахСАвтозаполнением(ДопРеквизитОбъект.Ссылка);
	ГруппыГдеДолженБытьРеквизит = НайтиГруппыСАвтозаполнениемДляДопРеквизита(ДопРеквизитОбъект.Заголовок, ДопРеквизитОбъект.ТипЗначения);
	
	Для каждого Группа из ГруппыГдеДолженБытьРеквизит Цикл
		Если ГруппыГдеЕстьРеквизит.Найти(Группа) = Неопределено Тогда
			ДобавитьДопРеквизитВГруппу(Группа, ДопРеквизитОбъект.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Группа из ГруппыГдеЕстьРеквизит Цикл
		Если ГруппыГдеДолженБытьРеквизит.Найти(Группа) = Неопределено Тогда
			УдалитьДопРеквизитьИзГруппы(Группа, ДопРеквизитОбъект.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ТипЗначенияПодходит(ТипЗначенияГруппы, ТипЗначенияДопРеквизита) Экспорт
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ТипЗначенияГруппы.Типы(), ТипЗначенияДопРеквизита.Типы()) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоДопРеквизитОР(НаборСвойств) 
	
	МассивРодителей = Новый Массив;
	МассивРодителей.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_ОбъектыРемонта"));
	МассивРодителей.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_НаправленияОбъектовРемонтныхРабот"));
	МассивРодителей.Добавить(УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_ТиповыеОР"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|ГДЕ
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка В ИЕРАРХИИ(&Родитель)
	|	И НаборыДополнительныхРеквизитовИСведений.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Родитель", МассивРодителей);
	Запрос.УстановитьПараметр("Ссылка", НаборСвойств);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Процедура УдалитьДопРеквизитИзГруппСАвтозаполнением(ДопРеквизит)
	
	МассивГрупп = НайтиДопРеквизитВГруппахСАвтозаполнением(ДопРеквизит);
	
	Для каждого Группа из МассивГрупп Цикл
		УдалитьДопРеквизитьИзГруппы(Группа, ДопРеквизит);
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиДопРеквизитВГруппахСАвтозаполнением(ДопРеквизит)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.СписокХарактеристик КАК торо_ГруппыХарактеристикОборудованияСписокХарактеристик
	|ГДЕ
	|	торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Характеристика = &Характеристика
	|	И торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Ссылка.ЗаполнятьАвтоматически";

	Запрос.УстановитьПараметр("Характеристика", ДопРеквизит);
	
	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция НайтиГруппыСАвтозаполнениемДляДопРеквизита(Наименование, ТипЗначения)
	
	МассивГрупп = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РазличныеГруппы
	|ИЗ
	|	ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.ПараметрыАвтозаполнения КАК торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения
	|ГДЕ
	|	торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.НаименованиеХарактеристики = &НаименованиеХарактеристики
	|	И торо_ГруппыХарактеристикОборудованияПараметрыАвтозаполнения.Ссылка.ЗаполнятьАвтоматически
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазличныеГруппы.Ссылка КАК Ссылка,
	|	РазличныеГруппы.Ссылка.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	РазличныеГруппы КАК РазличныеГруппы";
	
	Запрос.УстановитьПараметр("НаименованиеХарактеристики", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗначенияПодходит(Выборка.ТипЗначения, ТипЗначения) Тогда
			МассивГрупп.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивГрупп;
	
КонецФункции

Процедура УдалитьДопРеквизитьИзГруппы(Группа, ДопРеквизит)
	
	СтруктураПоиска = Новый Структура("Характеристика", ДопРеквизит);
	
	Попытка
		ГруппаОбъект = Группа.ПолучитьОбъект();
		СтрокиКУдалению = ГруппаОбъект.СписокХарактеристик.НайтиСтроки(СтруктураПоиска);
		Для каждого СтрокаКУдалению из СтрокиКУдалению Цикл
			ГруппаОбъект.СписокХарактеристик.Удалить(СтрокаКУдалению);
		КонецЦикла;
		ГруппаОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаОбъект.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбновлениеГруппХарактеристикОборудования", УровеньЖурналаРегистрации.Ошибка,
		ПланыВидовХарактеристик.торо_ГруппыХарактеристикОборудования, Группа, ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьДопРеквизитВГруппу(Группа, ДопРеквизит)
	
	Попытка
		ГруппаОбъект = Группа.ПолучитьОбъект();
		НоваяСтрока = ГруппаОбъект.СписокХарактеристик.Добавить();
		Новаястрока.Характеристика = ДопРеквизит;
		ГруппаОбъект.ОбменДанными.Загрузка = Истина;
		ГруппаОбъект.Записать();
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбновлениеГруппХарактеристикОборудования", УровеньЖурналаРегистрации.Ошибка,
		ПланыВидовХарактеристик.торо_ГруппыХарактеристикОборудования, Группа, ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
